[
  {
    "date": "June 2025",
    "title": "Master's Degree Completion",
    "description": "Successfully completed Master's degree in Medical Imaging and Applications with distinction."
  },
  {
    "date": "January 2025",
    "title": "Challenge Winner: Medical Image Registration and Application (MAIA8) Challenge",
    "description": "Won the challenge for developing an innovative medical image registration algorithm that accurately aligns Lung CT scans, improving diagnostic accuracy."
  },
  {
    "date": "January 2025",
    "title": "First Runner-up: Computer Aided Diagnostic (MAIA8) Challenge",
    "description": "Achieved first runner-up position in the challenge for creating a robust computer-aided diagnostic system for classifying skin lesions, demonstrating high accuracy and reliability."
  }, 
  {
    "date": "September 2023",
    "title": "Erasmus+ Scholarship Recipient",
    "description": "Awarded the prestigious Erasmus+ scholarship to pursue a Master's degree in Medical Imaging and Applications at the University of Burgundy, France, University of Cassino, Italy, and University of Girona, Spain."
  },
  {
    "date": "October 2022",
    "title": "Best Graduating Student",
    "description": "Recognized as the best graduating student in the department of Biomedical Engineering, and receiving the Vice Chancellor's Award for Academic Excellence."
  },
  {
    "date": "October 2022",
    "title": "Senate Annual Prize for First Class Honors",
    "description": "Senate Annual Prize for First Class Honors Graduating Students, 2020/2021 Academic Session."
  },
  {
    "date": "September 2021",
    "title": "Best Student in Biomedical Engineering (500L)",
    "description": "Awarded the 2020/2021 University Scholarship award for being the best student in Biomedical Engineering at 500 level."
  },
  {
    "date": "September 2020",
    "title": "Best Student in Biomedical Engineering (400L)",
    "description": "Awarded the 2019/2020 University Scholarship award for being the best student in Biomedical Engineering at 400 level."
  },
  {
    "date": "September 2020",
    "title": "Federal Scholarship Award",
    "description": "Selected as one of ~50 students in Nigeria to receive the 2020/2021 Federal Scholarship Award based on Academic excellence."
  },
  {
    "date": "September 2019",
    "title": "NABMES Award for Best Student in Biomedical Engineering",
    "description": "Received the 2018/2019 Scholar of the year award presented by National association of biomedical engineering students Unilorin."
  },
  {
    "date": "September 2019",
    "title": "Best Student in Biomedical Engineering (300L)",
    "description": "Awarded the 2018/2019 University Scholarship award for being the best student in Biomedical Engineering at 300 level."
  },
  {
    "date": "December 2018",
    "title": "NSBE Award for Academic Excellence",
    "description": "Selected as one of 20 Engineering Students to receive the 2018 National Society of Black Engineers Award for Academic Excellence."
  },
  {
    "date": "September 2018",
    "title": "Best Student in Biomedical Engineering (200L)",
    "description": "Awarded the 2017/2018 University Scholarship award for being the best student in Biomedical Engineering at 200 level."
  }

]